Revit 2027 API
WallSweepInfo.WallSide Property
 The side of the wall to which the sweep or reveal is attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallSide WallSide { get; set; }
Public Property WallSide As WallSide
	Get
	Set
public:
property WallSide WallSide {
	WallSide get ();
	void set (WallSide value);
}
member WallSide : WallSide with get, set
Property Value
WallSide
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace